let bangumi_group_name = [
    '週日（日）',
    '週一（月）',
    '週二（火）',
    '週三（水）',
    '週四（木）',
    '週五（金）',
    '週六（土）',
    '非週更'
];
let bangumi_data = [
    [
        ["辣妹與恐龍"],
        ["Healin' Good 光之美少女", "Healin'Good-Precure|ヒーリングっど|Q娃"],
        ["數碼寶貝：Ψ", "數碼寶貝|數碼獸大冒險|數碼暴龍|Digimon-Adventure"],
        ["智龍迷城", "智龍迷城|龍族拼圖"],
        ["闪亮 美妙☆频道", "美妙頻道|星光頻道"],
        ["甜夢貓"],
        ["寵物小精靈", "寶可夢|寵物小精靈"],
        ["Rebirth"],
        ["BORUTO-火影新世代-NARUTO NEXT GENERATIONS-", "火影"],
        ["大神同學想要被吃掉", "大神"],
        ["魔法科高中的劣等生 來訪者篇", "魔 劣 来访"],
        ["攀岩少女！", "Climbing"],
        ["無能力者娜娜", "无能 娜娜|奈奈"],
        ["IDOLiSH7 - 偶像星願 - Second BEAT！", "IDOLiSH"],
        ["眾神眷顧的男人", "神 男"],
        ["前說！", "前說"],
        ["體操武士", "體操"],
        ["憂國的莫里亞蒂"]
    ],
    [
        ["大肚皮的快樂生活"],
        ["秘密結社 鷹之爪 ～Golden・Spell～", "秘密結社"],
        ["成年人不懂如何戀愛"],
        ["Eternity 深夜的濡戀頻道", "濡戀"],
        ["滿溢的水果塔", "滿溢的"],
        ["A3! 第二季", "A3"],
        ["進撃的巨人The Final Season", "進撃的巨人"]
    ],
    [
        ["闇影詩章", "Shadowverse|影之詩|闇影詩章"],
        ["黃金神威 第三季", "黃金神威"],
        ["One Room 第三季", "One Room"],
        ["在魔王城說晚安", "在魔王城"],
        ["池袋西口公園"],
        ["光之戰記 -ZUERST-", "ZUERST"],
        ["阿松 第三季", "阿松"]
    ],
    [
        ["熊熊勇闖異世界"],
        ["月歌。第二季", "月歌"],
        ["這是妳與我的最後戰場，或是開創世界的聖戰", "與我 聖戰"],
        ["盡量加油吧！魔法少女胡桃 第三季", "胡桃"],
        ["大貴族"]
    ],
    [
        ["鋼彈創鬥者潛網大戰 第二季", "高達創|Re-RISE"],
        ["暮蟬悲鳴時 業", "蝉"],
        ["強襲魔女 通往柏林之路", "強襲魔女"],
        ["全員惡玉", "惡玉"],
        ["小碧藍幻想！"],
        ["土下座跪求給看"]
    ],
    [
        ["魔神英雄傳 七魂的龍神丸", "龍神"],
        ["Battle Spirits 赫盟的Galette", "Battle Spirits"],
        ["突擊莉莉 BOUQUET", "BOUQUET"],
        ["魔女之旅"],
        ["我立於百萬生命之上"],
        ["安達與島村"]
    ],
    [
        ["偶像活动 ON PARADE", "偶像活动"],
        ["游戏王 Sevens"],
        ["噴嚏大魔王2020", "噴嚏大魔王"],
        ["棒球大联盟2nd 第二季", "棒球 2nd"],
        ["『催眠麥克風-Division Rap Battle-』Rhyme Anima","催眠麥克風"],
        ["在地下城尋求邂逅是否搞錯了什麼 第三季", "地下城"],
        ["鐵路浪漫譚"],
        ["總之就是很可愛", "總之就是"],
        ["王之逆襲: 意志的繼承者", "王之逆襲"],
        ["咒術迴戰"],
        ["養了狗與貓 每天都好開心", "狗 貓"],
        ["排球少年!! TO THE TOP 2nd season", "排球少年"],
        ["D4DJ First Mix", "D4DJ"],
        ["勇者鬥惡龍 達伊的大冒險", "勇者鬥惡龍"],
        ["半妖的夜叉姬"],
        ["LoveLive! 虹咲學園校園偶像同好會", "虹咲學園"],
        ["戰翼的希格德莉法"],
        ["請問您今天要來點兔子嗎？BLOOM", "請問 bloom"],
        ["成神之日", "成 神"]
    ],
    [
        ["大欺詐師", "GREAT PRETENDER"],
    ]
];