let bangumi_group_name = [
    '週日（日）',
    '週一（月）',
    '週二（火）',
    '週三（水）',
    '週四（木）',
    '週五（金）',
    '週六（土）',
    '非週更'
];
let bangumi_data = [
    [
        ["伊甸星原", "EDENS ZERO"],
        ["恐龍莊日常", "恐龍 日"],
        ["RE-MAIN"],
        ["現實主義勇者的王國重建記", "現實主義勇者"],
        ["賈希大人不氣餒！", "賈希|迦希"],
        ["東京復仇者"],
        ["偶像活動Planet！", "偶像活動"],
        ["游戏王 Sevens"],
        ["Tropical-Rouge！光之美少女", "Tropical-Rouge|Q娃"],
        ["數碼寶貝：Ψ", "數碼寶貝|數碼獸大冒險|數碼暴龍|Digimon-Adventure"],
        ["智龍迷城", "智龍迷城|龍族拼圖"],
        ["美妙All Friends精選集", "美妙|星光"],
        ["甜夢貓 Mix"],
        ["寵物小精靈", "寶可夢|寵物小精靈"],
        ["BORUTO-火影新世代-NARUTO NEXT GENERATIONS-", "火影|博人传"],
        ["Love Live! Superstar!!", "Love Live Superstar"],
        ["蓋特機器人 ARC", "蓋特|盖塔 ARC"],
        ["偵探已經，死了。", "偵探 已經 死了"],
        ["死神少爺與黑女僕"],
        ["IDOLiSH7 - 偶像星願 - 第三期 上半季", "IDOLiSH7"],
        ["指尖傳出的真摯熱情2-戀人是消防員-", "指尖 消防"]
    ],
    [
        ["王者天下 第三季", "王者天下"],
        ["闇芝居 第九季", "闇芝居"],
        ["給不滅的你", "不滅的你"],
        ["急戰5秒殊死鬥", "5秒 鬥"]
    ],
    [
        ["陰晴不定的體操哥哥", "陰晴不定 哥哥"],
        ["精靈幻想記"],
        ["關於我轉生變成史萊姆這檔事 第二季 後半", "轉生 史萊姆"]
    ],
    [
        ["開掛藥師的異世界悠閒生活", "開掛藥師 異世界"],
        ["月光下的異世界之旅", "月光 異世界"],
        ["女神宿舍的管理員。", "女神宿舍"],
        ["小林家的龍女僕S", "小林家的龍女僕"]
    ],
    [
        ["NIGHT HEAD 2041"],
        ["通靈王", "SHAMAN KING"],
        ["SD鋼彈世界群英集", "SD 高达|鋼彈"],
        ["桃子男孩渡海而來"],
        ["緋紅結繫", "SCARLET NEXUS"],
        ["暮蟬鳴泣時 卒", "寒蝉|暮蟬 鸣泣"],
        ["白沙的Aquatope", "白 Aquatope"]
    ],
    [
        ["妖怪手錶 ♪", "妖怪手錶|妖怪手表"],
        ["新幹線變形機器人 Z"],
        ["戰鬥陀螺爆烈世代 Dynamite Battle", "陀螺"],
        ["認真地不認真的怪俠佐羅利 第2期", "怪俠佐羅利"],
        ["Sonny Boy"],
        ["平穩世代的韋駄天們"],
        ["暗黑企業的迷宮", "企业 黑"],
        ["瓦尼塔斯的手札", "瓦尼塔斯"]
    ],
    [
        ["BLUE REFLECTION 澪", "BLUE REFLECTION RAY"],
        ["卡片戰鬥!! 先導者 overDress", "overDress"],
        ["勇者鬥惡龍 達伊的大冒險", "勇者鬥惡龍"],
        ["我的英雄學院 第五季", "我的英雄學院"],
        ["入間同學入魔了 第二季", "入間同學入魔了"],
        ["我立於百萬生命之上 第二季", "百萬生命"],
        ["轉生成女性向遊戲只有毀滅END的壞人大小姐X", "转生 只"],
        ["叫我對大哥", "tsushima"],
        ["女朋友and女朋友", "女 友成|朋友"],
        ["我們的重製人生"],
        ["D_CIDE TRAUMEREI"],
        ["魔法科高中的優等生"],
        ["歌劇少女!!", "歌劇少女"],
        ["魔法紀錄 魔法少女小圓外傳 第二季 覺醒前夜", "魔法紀錄|記錄 外传"]
    ],
    [
        ["Rebirth"],
        ["舞伎家的料理人"],
        ["轉生成蜘蛛又怎樣！", "蜘蛛"]
    ]
];