let bangumi_group_name = [
    '週日（日）',
    '週一（月）',
    '週二（火）',
    '週三（水）',
    '週四（木）',
    '週五（金）',
    '週六（土）',
    '非週更'
];
let bangumi_data = [
    [
        ["偶像活動Planet！", "偶像活動"],
        ["Tropical-Rouge！光之美少女", "Tropical-Rouge|Q娃"],
        ["數碼寶貝 幽灵游戏", "數碼寶貝|數碼獸大冒險|數碼暴龍|Digimon Ghost Game"],
        ["智龍迷城", "智龍迷城|龍族拼圖"],
        ["美妙魔法！", "美妙|PriMagi"],
        ["寵物小精靈", "寶可夢|寵物小精靈"],
        ["BORUTO-火影新世代-NARUTO NEXT GENERATIONS-", "火影|博人传"],
        ["蔷薇王的葬列"],
        ["BUILD-DIVIDE -#FFFFFF- CODE WHITE", "BUILD DIVIDE"],
        ["游戏王 GORUSH!!", "游戏王"],
        ["决斗大师 King MAX", "决斗大师"],
        ["瓶盖革命 宝特瓶超人 DX", "宝特瓶"],
        ["魔法纪录 魔法少女小圆外传 最终季 浅梦之晓", "魔法纪录"],
        ["女性向游戏世界对路人角色很不友好", "女性向游戏"],
        ["黑岩射手 DAWN FALL", "黑岩射手"],
        ["式守同学不止可爱而已", "式守"],
        ["这个僧侣有够烦", "医师|僧侣 烦"],
        ["蔷薇王的葬列"],
        ["杜鹃的婚约", "杜鹃 婚约"]
    ],
    [
        ["3秒后，变身成野兽。", "3秒 野兽"],
        ["Chiikawa"],
        ["INSECT LAND"],
        ["忍者乱太郎 第30期", "忍者乱太郎"],
        ["Healer Girl"],
        ["Onipan!", "Onipan"],
        ["境界战机 第二部", "境界战机"]
    ],
    [
        ["名侦探柯南 零的日常", "柯南"],
        ["勇者辞职不干了", "勇者 辞职"],
        ["BIRDIE WING"],
        ["书虫的下克上～为了成为图书管理员而不择手段～ 第三季", "书虫|小书痴"],
        ["真·一骑当千", "一骑当千"]
    ],
    [
        ["朋友游戏"],
        ["史上最强大魔王转生为村民A", "村民A"],
        ["RPG不动产"],
        ["盾之勇者成名录 第2期", "盾之勇者"],
        ["相合之物"],
        ["古见同学有交流障碍症 2期", "古见"]
    ],
    [
        ["通靈王", "SHAMAN KING"],
        ["SD鋼彈世界群英集", "SD 高达|鋼彈"],
        ["派对浪客孔明", "派对 孔明"],
        ["围城人生", "Estab Life"],
        ["邪神与厨二病少女X mame动画（北海道篇）", "邪神 厨二病"],
        ["社畜小姐想被幽灵幼女治愈。", "社畜 幽灵"],
        ["成为女主角！~被讨厌的女主角和秘密的工作~", "成为女主角"],
        ["骸骨骑士大人异世界冒险中", "骸骨骑士"],
        ["夏日重现", "夏日|summer time"]
    ],
    [
        ["妖怪手錶 ♪", "妖怪手錶|妖怪手表"],
        ["新幹線變形機器人 Z"],
        ["戰鬥陀螺爆烈世代 Dynamite Battle", "陀螺"],
        ["爆丸 Evolutions", "爆丸"],
        ["街角魔族 2丁目", "街角魔族"],
        ["魔法使黎明朝"],
        ["TIGER & BUNNY 第二季", "TIGER BUNNY"],
        ["谈恋爱要在征服世界后"],
        ["约会大作战 第四季", "约会大作战"],
        ["辉夜大小姐想让我告白 超级浪漫作战", "辉夜 告白"]
    ],
    [
        ["勇者鬥惡龍 達伊的大冒險", "勇者鬥惡龍"],
        ["叫我對大哥", "tsushima"],
        ["CUE!"],
        ["处刑少女的生存之道"],
        ["理科生坠入情网故尝试证明。r=1-sinθ", "理科生"],
        ["雀魂麻将 PONG☆", "雀魂"],
        ["测不准的阿波连同学", "阿波连"],
        ["影之诗F", "影之诗"],
        ["Love All Play"],
        ["八十龟酱观察日记 第四册", "八十龟"],
        ["LoveLive! 虹咲学园学园偶像同好会 S2", "虹咲"],
        ["群青的号角", "的号角"],
        ["舞动不止"],
        ["青之芦苇"],
        ["间谍过家家", "spy family"],
        ["女忍者椿的心事"],
        ["王者天下 第四季", "王者天下"]
    ],
    [
        ["Rebirth"],
        ["舞伎家的料理人"],
        ["小太郎一个人生活"],
        ["名侦探柯南 警察学校篇 第2弹 CASE.伊达航", "柯南"],
        ["Eve动画现场演唱会", "Adam Eve live"],
        ["机动奥特曼 二期", "ULTRAMAN"],
        ["新罗马浴场", "罗马浴场"],
        ["花园里的吸血鬼", "Vampire in the Garden"],
        ["攻壳机动队 SAC_2045 第二季", "攻壳 SAC"],
        ["轰天高校生 SPRIGGAN", "SPRIGGAN"],
        ["BASTARD!!暗黑破坏神", "BASTARD"]
    ]
];