let bangumi_group_name = [
    '週日（日）',
    '週一（月）',
    '週二（火）',
    '週三（水）',
    '週四（木）',
    '週五（金）',
    '週六（土）',
    '非週更'
];
let bangumi_data = [
    [
        ["Healin' Good 光之美少女", "Healin'Good-Precure|ヒーリングっど|Q娃"],
        ["數碼寶貝：Ψ", "數碼寶貝|數碼獸大冒險|數碼暴龍|Digimon-Adventure"],
        ["智龍迷城", "智龍迷城|龍族拼圖"],
        ["美妙频道", "美妙頻道|星光頻道"],
        ["甜夢貓"],
        ["寵物小精靈", "寶可夢|寵物小精靈"],
        ["Rebirth"],
        ["BORUTO-火影新世代-NARUTO NEXT GENERATIONS-", "火影"],
        ["堀與宮村"],
        ["境界觸發者 第2期", "境界觸發者"],
        ["怪病醫拉姆尼"],
        ["SK∞", "SK"],
        ["Tropical Rouge! Precure"],
        ["八十龜醬觀察日記 第三冊"],
        ["怪物事變"],
        ["花樣滑冰Stars", "滑冰 leading"],
        ["偶像榮耀（IDOLY PRIDE）", "IDOLY PRIDE"],
        ["無職轉生～到了異世界就拿出真本事～", "無職"]
    ],
    [
        ["大肚皮的快樂生活"],
        ["秘密結社 鷹之爪 ～Golden・Spell～", "秘密結社"],
        ["GIRL學。～聖GIRLS²學園～", "GIRL學"],
        ["突然降臨的埃及神", "埃及神"],
        ["進擊的巨人The Final Season", "進擊的巨人"],
        ["俗女純愛大作戰", "俗女純愛大作戰|地味变"],
        ["EX-ARM"],
        ["悠悠哉哉少女日和 第三季", "悠哉|Biyori"],
        ["暗芝居 第八季", "暗芝居"],
        ["比方說，這是個出身魔王關附近的少年在新手村生活的故事", "新手村"],
        ["裏世界遠足"],
        ["賽馬娘 第二季", "馬娘"]
    ],
    [
        ["闇影詩章", "Shadowverse|影之詩|闇影詩章"],
        ["阿松 第三季", "阿松"],
        ["碧藍航線 微速前進！", "碧蓝 微速"],
        ["廚神小當家 第二季", "小當家"],
        ["劇偶像"],
        ["關於我轉生變成史萊姆這檔事 第二季 第1部", "史萊姆"]
    ],
    [
        ["文豪野犬 汪！", "文豪野犬 汪"],
        ["世界魔女出動！"],
        ["奇蛋物語（WONDER EGG PRIORITY）", "WONDER EGG PRIORITY"],
        ["七大罪 憤怒的審判"],
        ["記錄的地平線 圓桌崩壞"],
        ["魔術士歐菲 流浪之旅 基姆拉克篇", "魔術士"],
        ["Re：從零開始的異世界生活 第二季 後半季", "從零"],
        ["ICHU偶像進行曲", "chu 偶像"],
        ["回復術士的重啟人生"],
        ["裝甲娘戰機"]
    ],
    [
        ["暮蟬悲鳴時 業", "蝉"],
        ["蒼之騎士團"],
        ["BEASTARS 第二季", "BEASTARS"],
        ["Dr.STONE 新石紀 第二季", "Dr.STONE"],
        ["SHOW BY ROCK!! STARS!!", "SHOW BY ROCK"],
        ["搖曳露營△ 第二季", "摇曳露营|輕營"],
        ["天地創造設計部"]
    ],
    [
        ["D4DJ First Mix", "D4DJ"],
        ["2.43 清陰高中男子排球社", "2.43 清陰"],
        ["約定的夢幻島 第二季", "約定的夢幻島"],
        ["五等分的新娘∬", "五等分"],
        ["妖怪學園Y～與N的遭遇～", "妖怪學園"],
        ["弱勢角色友崎君", "友崎"],
        ["轉生成蜘蛛又怎樣！", "蜘蛛"],
        ["BACK ARROW"]
    ],
    [
        ["偶像活動 Planet！", "偶像活动"],
        ["游戏王 Sevens"],
        ["王之逆襲: 意志的繼承者", "王之逆襲"],
        ["咒術迴戰"],
        ["養了狗與貓 每天都好開心", "狗 貓"],
        ["勇者鬥惡龍 達伊的大冒險", "勇者鬥惡龍"],
        ["半妖的夜叉姬"],
        ["WIXOSS DIVA(A)LIVE", "WIXOSS"],
        ["大人的防具店 第二季"],
        ["重創的傷口", "Praeter"],
        ["只有我能進入的隱藏迷宮"],
        ["工作細胞!!", "工作細胞"],
        ["工作細胞BLACK", "工作細胞 BLACK"]

    ],
    [
        ["Battle Spirits 赫盟的Galette", "Battle Spirits"],
        ["幼女社長"],
        ["VLAD LOVE"],
        ["天空侵犯"],
        ["舞伎家的料理人"]
    ]
];