let bangumi_group_name = [
    '週日（日）',
    '週一（月）',
    '週二（火）',
    '週三（水）',
    '週四（木）',
    '週五（金）',
    '週六（土）',
    '非週更'
];
let bangumi_data = [
    [
        ["名侦探柯南"],
        ["海贼王"],
        ["火影忍者 博人传之火影次世代","博人传 火影"],
        ["数码兽 幽灵游戏", "数码宝贝"],
        ["飙速宅男 LIMIT BREAK", "飙速宅男"],
        ["致不灭的你 Season2", "致不灭的你"],
        ["魔王学院的不适任者～史上最强的魔王始祖，转生就读子孙们的学校～ Ⅱ", "魔王学院"],
        ["不要欺负我，长瀞同学 二次攻击", "长瀞同学"],
        ["最强阴阳师的异世界转生记", "最强阴阳师"],
        ["为了养老金去异世界存八万金", "养老金"],
        ["东京复仇者 圣夜决战篇", "东京复仇者"],
        ["KJ FILE 续篇", "KJ FILE"],
        ["沦落者之夜", "沦落者之夜"],
        ["万事屋斋藤，到异世界", "斋藤"],
        ["英雄传说 闪之轨迹：北方战役", "闪之轨迹"],
        ["被神捡到的男人 2期", "神捡 男"],
        ["伸向天空！光之美少女", "光之美少女"]
    ],
    [
        ["呆萌酷男孩"],
        ["我与机器子", "我与机器"],
        ["Show Time！唱歌的大姐姐也想做 2期", "Show Time"],
        ["虚构推理 2期", "虚构推理"],
        ["再得一胜！", "再得一胜"],
        ["家里蹲的日常 狗狗小町与猫咪多比", "家里蹲|尼特|neet"]
        ["HIGH CARD", "HIGH CARD"],
        ["吸血鬼马上死 2期", "吸血鬼马上死"],
        ["物之古物奇谭", "物之古物奇谭|物物语"]
    ],
    [
        ["海盗战记 2期", "海盗战记|冰海战记"],
        ["妖幻三重奏"],
        ["英雄王，为了穷尽武道而转生～然后，成为世界最强的见习骑士♀～", "英雄王"],
        ["久保同学不放过我", "久保同学"],
        ["不相信人类的冒险者们好像要去拯救世界", "不相信人"],
        ["拥有超常技能的异世界流浪美食家", "技能 异世界 美食"],
        ["FLAGLIA"]
    ],
    [
        ["想要成为影之实力者！", "影之实力者"],
        ["转生王女与天才千金的魔法革命", "魔法革命"],
        ["冰属性男子与酷酷女同事", "冰属性男子"],
        ["文豪野犬 第四季", "文豪野犬"],
        ["弦音 -联系的一箭-", "弦音"],
        ["超技舞台", "超技舞台|OVERMIND"],
        ["埃及神明们的日常 2期", "埃及神明"],
        ["因为太怕痛就全点防御力了。 2期", "怕痛"],
        ["魔术士奥芬的无赖之旅 拉玛城篇", "魔术士奥芬"]
    ],
    [
        ["福星小子 2022", "福星小子"],
        ["智酱是女生", "智 女"],
        ["复仇者", "复仇者|REVENGER"],
        ["间谍教室"],
        ["期待在地下城邂逅有错吗 Ⅳ 深章 灾厄篇", "地下城邂逅"],
        ["不当哥哥了！", "当哥哥了|当欧尼酱了"],
        ["大雪海的凯纳", "大雪海"]
    ],
    [
        ["百万吨级武藏 第2季", "百万吨级武藏"],
        ["哆啦A梦"],
        ["LUPIN ZERO"],
        ["冰剑的魔术师将要统一世界", "冰剑 魔"],
        ["异世界悠闲农家", "异世界 农家"],
        ["砂糖苹果童话故事 银砂糖师与黑色妖精", "砂糖 妖精"],
        ["虹四格", "虹四|虹团"],
        ["Buddy Daddies 杀手奶爸", "Buddy Daddies"],
        ["D4DJ All Mix"]
    ],
    [
        ["影之诗F"],
        ["入间同学入魔了 第三季", "入间同学入魔了"],
        ["BLUE LOCK 蓝色监狱","蓝色监狱"],
        ["阿鲁斯的巨兽"],
        ["变成狗后被喜欢的人捡了。", "变成狗"],
        ["傲娇反派千金莉洁洛特与实况主远藤同学及解说员小林同学", "解说员小林"],
        ["被解雇的暗黑士兵（30多岁）慢活的第二人生", "暗黑士兵"],
        ["关于邻家的天使大人不知不觉把我惯成了废人这档子事", "邻家 天使"],
        ["枪神 斯坦比特", "TRIGUN STAMPEDE"],
        ["UniteUp! 众星齐聚", "UniteUp"],
        ["尼尔：机械纪元", "尼尔"],
        ["真·进化之实 ~不知不觉踏上胜利的人生~", "进化之实"],
        ["卡片战斗先导者 will+Dress 2期", "卡片战斗先导者"],
        ["狩火之王"]
    ],
    [
        ["终末的女武神 2期 前篇", "终末的女武神"],
        ["冰雪极境", "MAKE MY DAY"],
        ["极主夫道 第二季", "极主夫道"],
        ["看脸时代", "Lookism"],
        ["伊藤润二《狂热集》", "伊藤润二"],
        ["女校之星"],
        ["职场小烈 5期", "小烈|烈子"],
        ["鲁邦三世 VS 猫眼三姐妹"]
    ]
];