let bangumi_group_name = [
    '週日（日）',
    '週一（月）',
    '週二（火）',
    '週三（水）',
    '週四（木）',
    '週五（金）',
    '週六（土）',
    '非週更'
];
let bangumi_data = [
    [
        ["SHADOWS HOUSE-影宅-", "影宅"],
        ["伊甸星原", "EDENS ZERO"],
        ["恐龍莊日常", "恐龍 日"],
        ["不要欺負我，長瀞同學", "長瀞"],
        ["大運動會 ReSTART!", "大運動會 ReSTART"],
        ["美少年偵探團"],
        ["東京復仇者"],
        ["偶像活動Planet！", "偶像活動"],
        ["游戏王 Sevens"],
        ["Tropical-Rouge！光之美少女", "Tropical-Rouge|Q娃"],
        ["數碼寶貝：Ψ", "數碼寶貝|數碼獸大冒險|數碼暴龍|Digimon-Adventure"],
        ["智龍迷城", "智龍迷城|龍族拼圖"],
        ["美妙频道", "美妙頻道|星光頻道"],
        ["甜夢貓 Mix"],
        ["寵物小精靈", "寶可夢|寵物小精靈"],
        ["BORUTO-火影新世代-NARUTO NEXT GENERATIONS-", "火影"],
        ["戰鬥員派遣中！", "戰鬥員 派遣"],
        ["龍先生，想要買個家。", "龍 買"],
        ["憂國的莫里亞蒂 後半季","憂國的莫里亞蒂"],
        ["MEGALOBOX 機甲拳擊 第二季", "MEGALOBOX"],
        ["再見了，我的克拉默", "克拉默"],
        ["變身成黑辣妹之後就和死黨上床了", "黑辣妹"],
        ["七騎士 革命 －英雄的繼承者－", "七騎士"]
    ],
    [
        ["王者天下 第三季", "王者天下"],
        ["如果這叫愛情感覺會很噁心", "爱情 恶心|奇怪"],
        ["刮掉鬍子的我與撿到的女高中生", "胡子|剃须 高中生"],
        ["燒窯的話也要馬克杯", "馬克杯"],
        ["給不滅的你", "不滅的你"]
    ],
    [
        ["魔法水果籃 最終季", "果籃"],
        ["MARS RED"],
        ["奇巧計程車", "Odd Taxi"],
        ["冰冰冰 冰淇淋（iii icecrin）", "iii icecrin"],
        ["轉生史萊姆日記"],
        ["聖女魔力無所不能", "聖女 魔力"]
    ],
    [
        ["擾亂 THE PRINCESS OF SNOW AND BLOOD"],
        ["世界魔女出動！", "世界魔女"],
        ["七大罪 憤怒的審判"],
        ["如果究極進化的完全沉浸RPG比現實還更像垃圾遊戲的話", "full dive rpg"],
        ["本田小狼與我", "Super Cub"],
        ["青梅竹馬絕對不會輸的戀愛喜劇", "青梅竹馬絕對不會輸"]
    ],
    [
        ["席斯坦-The Roman Fighter-"],
        ["義呆利 World☆Stars", "world stars"],
        ["通靈王", "SHAMAN KING"],
        ["哥吉拉：奇異點", "Godzilla"],
        ["Fairy 蘭丸～讓我來幫助你的心～", "Fairy 蘭丸"],
        ["佐賀偶像是傳奇 捲土重來", "佐賀偶像是傳奇"]
    ],
    [
        ["後空翻少年!!", "後空翻"],
        ["妖怪手錶 ♪", "妖怪手錶|妖怪手表"],
        ["新幹線變形機器人 Z"],
        ["戰鬥陀螺爆烈世代 Dynamite Battle", "陀螺"],
        ["認真地不認真的怪俠佐羅利 第2期", "怪俠佐羅利"],
        ["轉生成蜘蛛又怎樣！", "蜘蛛"],
        ["SSSS.DYNAZENON", "DYNAZENON"],
        ["BACK ARROW"]
    ],
    [
        ["灼熱卡巴迪"],
        ["美麗新世界 The Animation", "美妙世界|美麗新世界"],
        ["結城友奈是勇者 啾嚕！", "結城友奈是勇者"],
        ["BLUE REFLECTION : 澪", "BLUE REFLECTION RAY"],
        ["真白之音"],
        ["卡片戰鬥!! 先導者 overDress", "overDress"],
        ["勇者鬥惡龍 達伊的大冒險", "勇者鬥惡龍"],
        ["我的英雄學院 第五季", "我的英雄學院"],
        ["入間同學入魔了 第二季", "入間同學入魔了"],
        ["持續狩獵史萊姆三百年，不知不覺就練到 LV MAX", "史莱姆 300"],
        ["Thunderbolt Fantasy 東離劍遊紀 3", "東離劍遊紀"],
        ["Vivy -Fluorite Eye’s Song-", "Vivy"],
        ["86－不存在的戰區－", "86 不存在的戰區"]
    ],
    [
        ["Rebirth"],
        ["VLAD LOVE"],
        ["舞伎家的料理人"],
        ["教教我吧 北齋！", "北齋"],
        ["B：彼之初 繼承", "B The Beginning"],
        ["極道主夫", "極 道 主 夫"],
        ["彌助", "Yasuke"],
        ["伊甸", "EDEN"],
        ["終末的女武神"],
        ["奇蛋物語（WONDER EGG PRIORITY）特別篇", "WONDER EGG PRIORITY"]
    ]
];