let bangumi_group_name = [
    '週日（日）',
    '週一（月）',
    '週二（火）',
    '週三（水）',
    '週四（木）',
    '週五（金）',
    '週六（土）',
    '非週更'
];
let bangumi_data = [
    [
        ["恐龍莊日常", "恐龍 日"],
        ["賈希大人不氣餒！", "賈希|迦希"],
        ["偶像活動Planet！", "偶像活動"],
        ["游戏王 Sevens"],
        ["Tropical-Rouge！光之美少女", "Tropical-Rouge|Q娃"],
        ["數碼寶貝 幽灵游戏", "數碼寶貝|數碼獸大冒險|數碼暴龍|Digimon Ghost Game"],
        ["智龍迷城", "智龍迷城|龍族拼圖"],
        ["美妙魔法！", "美妙|PriMagi"],
        ["甜夢貓 Mix"],
        ["寵物小精靈", "寶可夢|寵物小精靈"],
        ["BORUTO-火影新世代-NARUTO NEXT GENERATIONS-", "火影|博人传"],
        ["Love Live! Superstar!!", "Love Live Superstar"],
        ["海盗公主", "Kaizoku Oujo"],
        ["三角窗外是黑夜"],
        ["阴阳眼见子", "见子|看得见的女孩"],
        ["特斯拉笔记"],
        ["鬼灭之刃 遊郭篇", "鬼灭之刃"],
        ["无职转生 第二部分", "无职转生"],
        ["创之界限", "Build Divide"],
        ["鲁邦三世 PART6", "鲁邦三世 6"],
        ["前辈有够烦", "前辈 烦"],
        ["无敌侠 舞动的英雄", "MUTEKING"],
        ["境界触发者 第三季", "境界触发者"],
        ["四季樱"]
    ],
    [
        ["月与莱卡与吸血公主", "莱卡 吸血"],
        ["星期一的丰满 第二季", "星期一"],
        ["加油！同期酱", "同期"],
        ["吸血鬼马上死"],
        ["逆转世界的电池少女"],
        ["卡片战斗先导者overDress S2", "overDress"]
    ],
    [
        ["境界战机"],
        ["进化之实"],
        ["高达破坏者 对战记录", "高达破坏者"],
        ["宿命回响", "takt"]
    ],
    [
        ["Deep Insanity THE LOST CHILD", "Deep Insanity"],
        ["键等", "Kaginado"],
        ["因为不是真正的伙伴而被逐出勇者队伍，流落到边境展开慢活人生", "队伍 慢 生活"],
        ["橘色骄傲 PRIDE OF ORANGE", "PRIDE OF ORANGE"],
        ["世界顶尖的暗杀者，转生为异世界贵族", "暗杀者"],
        ["古见同学有交流障碍症", "古见"],
        ["平家物语"]
    ],
    [
        ["通靈王", "SHAMAN KING"],
        ["SD鋼彈世界群英集", "SD 高达|鋼彈"],
        ["白沙的Aquatope", "白 Aquatope"],
        ["Muv-Luv Alternative"],
        ["迷宫标记者", "SAKUGAN"],
        ['白金終局', '金終局']
    ],
    [
        ["妖怪手錶 ♪", "妖怪手錶|妖怪手表"],
        ["新幹線變形機器人 Z"],
        ["戰鬥陀螺爆烈世代 Dynamite Battle", "陀螺"],
        ["認真地不認真的怪俠佐羅利 第2期", "怪俠佐羅利"],
        ["国王排名"],
        ["180秒能让你的耳朵感到幸福吗？", "耳朵 幸福"],
        ["终末的后宫"],
        ["有氧拳击"],
        ["SELECTION PROJECT"],
        ["百万吨级武藏"],
        ["献身给魔王伊伏洛基亚吧", "献身 魔王"],
        ["Visual prison"]
    ],
    [
        ["勇者鬥惡龍 達伊的大冒險", "勇者鬥惡龍"],
        ["我的英雄學院 第五季", "我的英雄學院"],
        ["叫我對大哥", "tsushima"],
        ["魔法紀錄 魔法少女小圓外傳 第三季", "魔法紀錄|記錄 外传"],
        ["异世界食堂2", "异世界食堂"],
        ["蓝色时期"],
        ["大正处女御伽话", "大正 女御伽话"],
        ["烧窑的话也要马克杯 2期", "烧窑 马克杯"],
        ["结城友奈是勇者 大满开之章", "结城友奈是勇者 大满开"],
        ["半妖的夜叉姬 二之章", "半妖的夜叉姬"],
        ["世界尽头的圣骑士"],
        ["86 -不存在的战区- 第二部分", "EIGHTY SIX"]
    ],
    [
        ["Rebirth"],
        ["舞伎家的料理人"],
        ["突击莉莉Fruits", "lily fruits"],
        ["范马刃牙"],
        ["极主夫道后半", "极主夫道|极夫主道"],
        ["超级小偷", "SUPER CROOKS"],
        ["烈子 S4", "烈子"],
        ["JOJO的奇妙冒险 石之海", "JOJO 石之海"],
        ["魔法高校的劣等生 追忆篇", "魔法高校的劣等生"],
        ["Vampire in the Garden"]
    ]
];