let bangumi_group_name = [
    '週日（日）',
    '週一（月）',
    '週二（火）',
    '週三（水）',
    '週四（木）',
    '週五（金）',
    '週六（土）',
    '非週更'
];
let bangumi_data = [
    [
        ["辣妹與恐龍"],
        ["Healin' Good 光之美少女", "Healin'Good-Precure|ヒーリングっど|Q娃"],
        ["數碼寶貝：Ψ", "數碼寶貝|數碼獸大冒險|數碼暴龍|Digimon-Adventure"],
        ["智龍迷城", "智龍迷城|龍族拼圖"],
        ["闪亮 美妙☆频道", "美妙頻道|星光頻道"],
        ["甜梦猫"],
        ["寵物小精靈", "寶可夢|寵物小精靈"],
        ["Rebirth"],
        ["SUPER SHIRO", "SUPER SHIRO|超級小白"],
        ["魔物娘的醫生"],
        ["忍者收藏"],
        ["巨人族的新娘"],
        ["BORUTO-火影新世代-NARUTO NEXT GENERATIONS-", "火影"]
    ],
    [
        ["別冊奧林匹克之環"],
        ["大肚皮的快樂生活"],
        ["超普通都市柏傳說R"],
        ["高校之神", "THE GOD OF HIGH SCHOOL"]
    ],
    [
        ["魔法水果籃", "水果籃子|魔法水果籃|Fruits-Basket"],
        ["闇影詩章", "Shadowverse|影之詩|闇影詩章"],
        ["放學后海堤日記", "放學 日記"],
        ["馬娘四格"],
        ["魔法律事務所 第二季", "魔法律事務所"]
    ],
    [
        ["籃球少年王", "鴨子的天空|籃球少年王"],
        ["獵魔武士", "GIBIATE"],
        ["Re：從零開始的異世界生活 2nd season", "從零開始"],
        ["DECA-DENCE"],
        ["戀與製作人～EVOL×LOVE～", "戀與製作人"]
    ],
    [
        ["鋼彈創鬥者潛網大戰 第二季", "高達創|Re-RISE"]
    ],
    [
        ["富豪刑警 Balance: UNLIMITED", "富豪刑"],
        ["魔神英雄傳 七魂的龍神丸", "龍神"],
        ["天晴爛漫", "天晴爛漫|Appare"],
        ["科學超電磁砲T", "炮T|砲T"],
        ["非槍人生 NO GUNS LIFE 第2期", "NO GUNS LIFE"],
        ["果然我的青春戀愛喜劇搞錯了。完", "我的青春"],
        ["弩級戰隊H×EROS", "弩級戰隊"],
        ["Battle Spirits 赫盟的Galette", "Battle Spirits"]
    ],
    [
        ["食戟之灵 豪之皿"],
        ["文豪與鍊金術師～審判的齒輪～", "文豪 審判"],
        ["偶像活动 ON PARADE", "偶像活动"],
        ["游戏王 Sevens"],
        ["噴嚏大魔王2020", "噴嚏大魔王"],
        ["棒球大联盟2nd 第二季", "棒球 2nd"],
        ["阿拉德：逆轉之輪"],
        ["炎炎消防隊 貳之章", "炎炎消防隊"],
        ["宇崎學妹想要玩！", "宇崎"],
        ["出租女友", "租 女友"],
        ["彼得·格里爾的賢者時間", "賢者時間"],
        ["GET UP! GET LIVE!"],
        ["寶石幻想 光芒重現", "Lapis LiGHTs"],
        ["魔王學院的不適任者", "魔王學院"],
        ["刀劍神域 Alicization War of Underworld"]
    ],
    [
        ["破曉之翼"],
        ["刃牙 大擂臺賽篇", "刃牙"],
        ["大欺詐師", "GREAT PRETENDER"],
        ["日本沉沒 2020"]
    ]
];