let data = {
	"data": [
		[
			["辣妹與恐龍"],
			["昨日之歌"],
			["轉生成為了只有乙女遊戲破滅Flag的邪惡大小姐", "转生 只"],
			["小書痴的下剋上 第二季", "書 下"],
			["Healin' Good 光之美少女", "Healin'Good-Precure|ヒーリングっど|Q娃"],
			["數碼寶貝：Ψ", "數碼寶貝|數碼獸大冒險|數碼暴龍|Digimon-Adventure"],
			["智龍迷城", "智龍迷城|龍族拼圖"],
			["闪亮 美妙☆频道", "美妙頻道|星光頻道"],
			["甜梦猫"],
			["寵物小精靈", "寶可夢|寵物小精靈"],
			["Rebirth"],
			["繼怪怪守護神", "Tsugumomo|繼怪怪守護神"],
			["IDOLiSH7 偶像星願 Second BEAT!", "IDOLiSH7"],
			["社長，戰鬥的時間到了", "社長，戰鬥的時間到了|shachou"],
			["格萊普尼爾", "格萊普尼爾|Gleipnir"],
			["SUPER SHIRO", "SUPER SHIRO|超級小白"],
			["用我的手指来扰乱吧", "我的手指|Ore-no-Yubi"]
		],
		[
			["王者天下 第三季", "王者天下"],
			["別冊奧林匹克之環"],
			["白貓Project ZERO CHRONICLE", "ZERO-CHRONICLE"],
			["啄木鳥偵探社", "啄木鳥"],
			["大肚皮的快樂生活"],
			["A3! 滿開劇團", "A3"]
		],
		[
			["超異域公主連結 Re:Dive", "公主|PCR|Princess-Connect"],
			["魔法水果籃", "水果籃子|魔法水果籃|Fruits-Basket"],
			["闇影詩章", "Shadowverse|影之詩|闇影詩章"],
			["放學后海堤日記", "放學 日記"]
		],
		[
			["籃球少年王", "鴨子的天空|籃球少年王"],
			["球詠"]
		],
		[
			["神之塔"],
			["鋼彈創鬥者潛網大戰 第二季", "高達創|Re-RISE"],
			["八男？別鬧了", "八男"],
			["隱瞞之事"]
		],
		[
			["富豪刑警 Balance: UNLIMITED", "富豪刑"],
			["座敷童子塌塌米醬", "座敷 tatami chan"],
			["魔神英雄傳 七魂的龍神丸", "龍神"],
			["天晴爛漫", "天晴爛漫|Appare"],
			["科學超電磁砲T", "炮T"],
			["新櫻花大戰 the Animation"]
		],
		[
			["食戟之灵 豪之皿"],
			["文豪與鍊金術師～審判的齒輪～", "文豪 審判"],
			["ARGONAVIS from BanG Dream!"],
			["LISTENERS"],
			["聽我的電波吧", "電波吧|nami-yo"],
			["偶像活动 ON PARADE", "偶像活动"],
			["游戏王 Sevens"],
			["噴嚏大魔王2020", "噴嚏大魔王"],
			["棒球大联盟2nd 第二季", "棒球 2nd"],
			["阿爾蒂", "Arte 阿爾蒂"],
			["輝夜大小姐想讓我告白 第二季", "輝夜 告白"]
		],
		[
			["破曉之翼"],
			["BNA", "BNA|new-animal|全新動物|動物新時代"],
			["攻殼機動隊 SAC_2045", "攻殼機動隊 SAC 2045"],
			["邪神與廚二病少女’", "邪神"],
			["刃牙 大擂臺賽篇", "刃牙"],
			["GREAT PRETENDER"]
		]
	]
}