let bangumi_group_name = [
    '週日（日）',
    '週一（月）',
    '週二（火）',
    '週三（水）',
    '週四（木）',
    '週五（金）',
    '週六（土）',
    '非週更'
];
let bangumi_data = [
    [
        ["偶像活動Planet！", "偶像活動"],
        ["游戏王 Sevens"],
        ["Tropical-Rouge！光之美少女", "Tropical-Rouge|Q娃"],
        ["數碼寶貝 幽灵游戏", "數碼寶貝|數碼獸大冒險|數碼暴龍|Digimon Ghost Game"],
        ["智龍迷城", "智龍迷城|龍族拼圖"],
        ["美妙魔法！", "美妙|PriMagi"],
        ["甜夢貓 Mix"],
        ["寵物小精靈", "寶可夢|寵物小精靈"],
        ["BORUTO-火影新世代-NARUTO NEXT GENERATIONS-", "火影|博人传"],
        ["鬼灭之刃 遊郭篇", "鬼灭之刃"],
        ["鲁邦三世 PART6", "鲁邦三世 6"],
        ["明日酱的水手服", "明日 水手服"],
        ["现实主义勇者的王国再建记 第二部", "现实主义勇者"],
        ["怪人开发部的黑井津", "黑井津"],
        ["白领羽球部", "白领 羽 球"],
        ["锖色护甲"],
        ["蔷薇王的葬列"],
        ["Futsal Boys!!!!!", "Futsal Boys"]
    ],
    [
        ["夜街酷斗 TRIBE NINE", "TRIBE NINE"],
        ["公主链接 第二季", "公主 链接|連結"],
        ["进击的巨人 The Final Season", "进击的巨人"],
        ["佐佐木与宫野"],
        ["王子的本命是恶役千金", "王子的本命"]
    ],
    [
        ["食锈末世录"],
        ["幻想三国志 天元灵心记"],
        ["天才王子的赤字国家再生术", "天才 王子"]
    ],
    [
        ["里亚德录大地"],
        ["秘密內幕 女警的反击", "秘密內幕"],
        ["东方少年", "orient"],
        ["与成为异世界美少女的大叔一起", "异世界美少女"],
        ["杀爱"]
    ],
    [
        ["通靈王", "SHAMAN KING"],
        ["SD鋼彈世界群英集", "SD 高达|鋼彈"],
        ['白金終局', '金終局'],
        ["东京24区"],
        ["最游记 RELOAD -ZEROIN-", "最游记"],
        ["平凡职业成就世界最强 第二季", "平凡职业成就世界最强"]
    ],
    [
        ["妖怪手錶 ♪", "妖怪手錶|妖怪手表"],
        ["新幹線變形機器人 Z"],
        ["戰鬥陀螺爆烈世代 Dynamite Battle", "陀螺"],
        ["認真地不認真的怪俠佐羅利 第2期", "怪俠佐羅利"],
        ["国王排名"],
        ["终末的后宫"],
        ["SLOW LOOP"],
        ["瓦尼塔斯的手记", "瓦尼塔斯"]
    ],
    [
        ["勇者鬥惡龍 達伊的大冒險", "勇者鬥惡龍"],
        ["叫我對大哥", "tsushima"],
        ["半妖的夜叉姬 二之章", "半妖的夜叉姬"],
        ["86 -不存在的战区- 第二部分", "EIGHTY SIX"],
        ["少女前线"],
        ["擅长捉弄的高木同学 第三季", "高木"],
        ["CUE!"],
        ["失格纹的最强贤者 ~世界最强贤者为了变得更强转生~", "失格纹"],
        ["更衣人偶坠入爱河", "更衣人偶|换装娃娃"]
    ],
    [
        ["Rebirth"],
        ["舞伎家的料理人"],
        ["突击莉莉Fruits", "lily fruits"],
        ["JOJO的奇妙冒险 石之海", "JOJO 石之海"],
        ["Vampire in the Garden"]
    ]
];