let bangumi_group_name = [
    '週日（日）',
    '週一（月）',
    '週二（火）',
    '週三（水）',
    '週四（木）',
    '週五（金）',
    '週六（土）',
    '非週更'
];
let bangumi_data = [
    [
        ["机动战士高达 水星的魔女", "高达 魔女"],
        ["点满农民相关技能后，不知为何就变强了。","农民 变强"],
        ["夫妇以上，恋人未满。", "恋人未满"],
        ["被勇者队伍开除的驯兽师，邂逅最强种猫耳少女", "驭兽使 猫耳少女"],
        ["彼得·格里尔的贤者时间 Super Extra", "格里尔的贤者时间"],
        ["IDOLiSH7-偶像星愿- Third BEAT! 第二季","IDOLiSH7"],
        ["飙速宅男 LIMIT BREAK", "飙速宅男"],
        ["致不灭的你 Season2", "致不灭的你"],
        ["后宫露营！", "后宫露营"],
        ["马娘摇曳", "马娘 摇曳"],
        ["名侦探柯南"],
        ["海贼王"],
        ["火影忍者 博人传之火影次世代","博人传 火影"],
        ["宝可梦 旅途"],
        ["数码兽 幽灵游戏", "数码宝贝"],
        ["美味派对♡光之美少女", "光之美少女"]
    ],
    [
        ["新人炼金术师的店铺经营", "炼金术师 店"],
        ["黄金神威 第四季", "黄金神威"],
        ["呆萌酷男孩"],
        ["永久少年 Eternal Boys","永久少年"],
        ["名侦探柯南 犯人犯泽先生", "柯南 犯人犯泽"],
        ["死神 千年血战篇", "死神"],
        ["風都偵探"],
        ["卡片戰鬥!! 先導者 will+Dress", "卡片戰鬥 先導者"]
    ],
    [
        ["忍者一时", "Shinobi no Ittoki"],
        ["电锯人", "Chainsaw Man"],
        ["LET'S GO！向山进发 Next Summit", "向山进发"]
    ],
    [
        ["異世界舅舅", "Isekai Ojisan"],
        ["转生成为魔剑","转生 剑"],
        ["恋爱FLOPS","FLOPS"],
        ["Do It Yourself!!"],
        ["想要成为影之实力者！", "影之实力者"],
        ["灵能百分百 第三季", "Mob Psycho 100"],
        ["无良公会", "公会"],
        ["Muv-Luv Alternative 第二季", "Muv-Luv"],
        ["某天早上变成人头麦克风的我君的人生"],
        ["人类毛病大学 -不死学部不幸学科-", "人类毛病大学"],
        ["月野艺能 华彩原石", "VAZZROCK THE ANIMATION"]
    ],
    [
        ["书虫公主"],
        ["秋叶原女仆战争", "秋叶原 战争"],
        ["福星小子 2022", "福星小子"],
        ["舰队Collection 总有一天，在那片海", "舰队Collection"],
    ],
    [
        ["惑星公主蜥蜴骑士", "惑星公主|五月雨"],
        ["圣剑传说 玛娜传奇 -泪珠水晶-", "圣剑传说"],
        ["我家师傅没有尾巴"],
        ["明日方舟：黎明前奏", "明日方舟"],
        ["百万吨级武藏 第2季", "百万吨级武藏"],
        ["令和的Di Gi Charat", "令和"],
        ["哆啦A梦"]
    ],
    [
        ["勇者斗恶龙 达伊的大冒险", "勇者斗恶龙"],
        ["影之诗F"],
        ["作为恶役大小姐就该养魔王","大小姐 养 魔王"],
        ["后宫之乌"],
        ["宇崎学妹想要玩！ω", "宇崎 想 玩"],
        ["四人各有小秘密"],
        ["间谍过家家 Part2","间谍过家家"],
        ["孤独摇滚！", "孤独摇滚"],
        ["入间同学入魔了 第三季", "入间同学入魔了"],
        ["剑风传奇 黄金时代篇 MEMORIAL EDITION", "剑风传奇"],
        ["BLUE LOCK 蓝色监狱","蓝色监狱"],
        ["我的英雄学院 第六季", "我的英雄学院"],
        ["pop子和pipi美的日常 第二季", "Pop Team Epic"],
        ["PUI PUI 天竺鼠车车 DRIVING SCHOOL", "天竺鼠车车"],
        ["傳頌之物 二人的白皇", "傳頌之物"],
        ["王者天下 第4季", "王者天下"]
    ],
    [
        ["JOJO的奇妙冒险 石之海 Part.2", "JOJO 石之海"],
        ["咒术回战 0"],
        ["鹿王 尤娜与约定之旅", "鹿王"],
        ["超时空要塞Δ 绝对LIVE!!!!!!", "超时空要塞"],
        ["DEEMO 樱之音 -你弹奏的声音，至今仍在回响- I still hear the sound of your piano", "DEEMO"],
        ["银河英雄传说 Die Neue These 策谋 第1章", "银河英雄传说"],
        ["浪漫殺手"]
    ]
];